tutorials/multiCompression/quadPiston/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0]; // K

internalField   uniform 858.1;

boundaryField
{
    // Injection
	"injectionXMinus|injectionXPlus|injectionYMinus|injectionYPlus"
    {
        type            uniformFixedValue;
        uniformValue    uniform 400;
    }

	// Inlet
	"inletXMinus|inletXPlus|inletYMinus|inletYPlus"
    {
        type            uniformFixedValue;
		uniformValue 	uniform 293.15;
    }

	// Other
    outlet
    {
        type            zeroGradient;
    } // outlet
    "valve|walls"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //