tutorials/multiCompression/quadPiston/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      		[0 1 -1 0 0 0 0]; // [kg m s K kg-mol cd]

internalField   		uniform (0 0 0);

injection 				20;

inlet 					5;

injectionMinus  		#calc "-1.0*$injection";

inletMinus				#calc "-1.0*$inlet";
	
boundaryField
{
    // Injection
	injectionXMinus
    {
		type            uniformFixedValue;
		uniformValue    constant ($injectionMinus 0 0);
    }
	injectionXPlus
    {
        type            uniformFixedValue;
        uniformValue    constant ($injection 0 0);
    }
	injectionYMinus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 $injectionMinus 0);
    }
	injectionYPlus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 $injection 0);
    }

	// Inlet
	inletXMinus
    {
        type            uniformFixedValue;
        uniformValue    constant ($inletMinus 0 0);
	}
	inletXPlus
    {
        type            uniformFixedValue;
        uniformValue    constant ($inlet 0 0);
    }
	inletYMinus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 $inletMinus 0);
    }
	inletYPlus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 $inlet 0);
    }

	// Other
    outlet
    {
        type            zeroGradient;
    }
    "valve|walls"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
