tutorials/multiCompression/quadPiston/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // Pa

internalField   uniform 10e04;

boundaryField
{
    // Injection
	"injectionXMinus|injectionXPlus|injectionYMinus|injectionYPlus"
    {
        type            zeroGradient;
    }
	
    // Inlet
	"inletXMinus|inletXPlus|inletYMinus|inletYPlus"
    {
        type            zeroGradient;
    }
	
	// Other
    outlet
    {
        type            fixedValue;
        value           uniform 10e04;
    }
    "valve|walls"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //