tutorials/multiCompression/quadPiston/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
	grad(p)			cellLimited Gauss linear 0.9; // UEqn
}

divSchemes
{
    default         Gauss cubic;
	div(phi,U)      Gauss upwind; // UEqn
	div(phi,e)      Gauss upwind; // eEqn
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         cubic;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //